// Data sourced from SANS Internet Storm Center / DShield API (https://isc.sans.edu/api/)
// Generated by StormInt TLD Query Generator

let suspicious_tlds = dynamic([".one", ".top", ".life", ".love", ".to", ".lol", ".yachts", ".click", ".store", ".cyou", ".xyz", ".tokyo", ".world", ".hair", ".shop", ".lat", ".fun", ".biz", ".bid", ".art", ".website", ".vip", ".buzz", ".icu", ".mobi", ".asia", ".cfd", ".pics", ".cloud", ".info", ".digital", ".ink", ".tech", ".site", ".help", ".work", ".beer", ".bond", ".sbs", ".app", ".space", ".club", ".dev", ".makeup", ".studio", ".online", ".live", ".blog", ".pro", ".link"]);
EmailEvents
| where SenderFromDomain has_any (suspicious_tlds)
| project TimeGenerated, Subject, SenderFromAddress, RecipientEmailAddress, SenderFromDomain
| summarize count() by Subject, SenderFromAddress, RecipientEmailAddress, SenderFromDomain
| order by count_ desc
