// Data sourced from SANS Internet Storm Center / DShield API (https://isc.sans.edu/api/)
// Generated by StormInt TLD Query Generator

let suspicious_tlds = dynamic([".club", ".link", ".xyz", ".blog", ".shop", ".biz", ".info", ".space", ".bond", ".group", ".art", ".rest", ".click", ".website", ".fun", ".today", ".courses", ".lat", ".lol", ".buzz", ".dev", ".world", ".casino", ".asia", ".digital", ".ink", ".top", ".mom", ".work", ".site", ".pro", ".vip", ".pics", ".cloud", ".studio", ".app", ".help", ".xin", ".life", ".live", ".store", ".icu", ".cfd", ".tech", ".bet", ".online", ".cyou", ".one", ".sbs", ".wiki"]);
EmailEvents
| where SenderFromDomain has_any (suspicious_tlds)
| project TimeGenerated, Subject, SenderFromAddress, RecipientEmailAddress, SenderFromDomain
| summarize count() by Subject, SenderFromAddress, RecipientEmailAddress, SenderFromDomain
| order by count_ desc
