// Data sourced from SANS Internet Storm Center / DShield API (https://isc.sans.edu/api/)
// Generated by StormInt TLD Query Generator

let suspicious_tlds = dynamic([".forum", ".icu", ".cfd", ".sbs", ".vip", ".studio", ".best", ".one", ".blog", ".run", ".work", ".life", ".bond", ".beauty", ".beer", ".link", ".skin", ".club", ".cloud", ".live", ".buzz", ".art", ".world", ".tokyo", ".bet", ".online", ".fun", ".asia", ".store", ".shop", ".mobi", ".top", ".dev", ".info", ".click", ".cyou", ".website", ".lat", ".ink", ".space", ".help", ".site", ".xyz", ".pics", ".biz", ".tech", ".lol", ".digital", ".app", ".pro"]);
EmailEvents
| where SenderFromDomain has_any (suspicious_tlds)
| project TimeGenerated, Subject, SenderFromAddress, RecipientEmailAddress, SenderFromDomain
| summarize count() by Subject, SenderFromAddress, RecipientEmailAddress, SenderFromDomain
| order by count_ desc
